Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.cloud_sql[0].google_sql_database_instance.primary will be created
+ resource "google_sql_database_instance" "primary" {
      + connection_name               = (known after apply)
      + database_version              = "SQLSERVER_2017_STANDARD"
      + deletion_protection           = true
      + encryption_key_name           = (known after apply)
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "development-db-56tam"
      + private_ip_address            = (known after apply)
      + project                       = "dark-axe-359021"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + root_password                 = (sensitive value)
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "REGIONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-custom-8-52480"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = true
              + start_time                     = "23:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/dark-axe-359021/global/networks/development-vpc"
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.cluster[0].google_container_cluster.cluster will be created
+ resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 32
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.23.5-gke.1503"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "atlantis-cluster"
      + network                     = "development-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "dark-axe-359021"
      + remove_default_node_pool    = true
      + resource_labels             = {
          + "environment" = "test"
        }
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "development-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = true
            }

          + config_connector_config {
              + enabled = false
            }

          + dns_cache_config {
              + enabled = false
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }

          + gcp_filestore_csi_driver_config {
              + enabled = false
            }

          + gke_backup_agent_config {
              + enabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + disabled = true
            }

          + kalm_config {
              + enabled = false
            }

          + network_policy_config {
              + disabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + autoscaling_profile = (known after apply)
          + enabled             = (known after apply)

          + auto_provisioning_defaults {
              + boot_disk_kms_key = (known after apply)
              + image_type        = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + service_account   = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config {
          + cidr_blocks {
              + cidr_block   = "10.0.0.0/16"
              + display_name = "internal-vms"
            }
          + cidr_blocks {
              + cidr_block   = "104.132.57.95/32"
              + display_name = "office"
            }
          + cidr_blocks {
              + cidr_block   = "186.22.152.169/32"
              + display_name = "external"
            }
        }

      + mesh_certificates {
          + enable_certificates = (known after apply)
        }

      + monitoring_config {
          + enable_components = (known after apply)

          + managed_prometheus {
              + enabled = (known after apply)
            }
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + spot              = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + ephemeral_storage_config {
              + local_ssd_count = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + reservation_affinity {
              + consume_reservation_type = (known after apply)
              + key                      = (known after apply)
              + values                   = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + network_config {
              + create_pod_range    = (known after apply)
              + pod_ipv4_cidr_block = (known after apply)
              + pod_range           = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + reservation_affinity {
                  + consume_reservation_type = (known after apply)
                  + key                      = (known after apply)
                  + values                   = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + type = (known after apply)
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.16.0.16/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = false
            }
        }

      + release_channel {
          + channel = "UNSPECIFIED"
        }

      + tpu_config {
          + enabled                = (known after apply)
          + ipv4_cidr_block        = (known after apply)
          + use_service_networking = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = "dark-axe-359021.svc.id.goog"
        }
    }

  # module.linux_nodepool[0].google_container_node_pool.nodepool will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = "atlantis-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 2
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "linux-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "dark-axe-359021"
      + version                     = "1.23.5-gke.1503"

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = 0
          + machine_type      = "g1-small"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = []

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 0
          + max_unavailable = 0
        }
    }

  # module.linux_nodepool[0].google_service_account.service_account[0] will be created
+ resource "google_service_account" "service_account" {
      + account_id   = "tf-gke-linux-node-pool"
      + disabled     = false
      + display_name = "Terraform GKE atlantis-cluster linux-node-pool."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "dark-axe-359021"
      + unique_id    = (known after apply)
    }

  # module.nodepool_windows[0].google_container_node_pool.nodepool will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = "atlantis-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 2
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "windows-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "dark-axe-359021"
      + version                     = "1.24.2-gke.1900"

      + autoscaling {
          + max_node_count = 1
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "WINDOWS_SAC_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-2"
          + metadata          = {
              + "disable-legacy-endpoints"   = "true"
              + "windows-startup-script-url" = "https://storage.googleapis.com/ibrahimab-public/update_containerd_166.ps1"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "node.kubernetes.io/os"
                  + value  = "windows"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 0
          + max_unavailable = 0
        }
    }

  # module.nodepool_windows[0].google_service_account.service_account[0] will be created
+ resource "google_service_account" "service_account" {
      + account_id   = "tf-gke-windows-node-pool"
      + disabled     = false
      + display_name = "Terraform GKE atlantis-cluster windows-node-pool."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "dark-axe-359021"
      + unique_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.cluster.google_container_cluster.cluster,
│   on modules/gke-cluster/main.tf line 46, in resource "google_container_cluster" "cluster":
│   46:   enable_binary_authorization = var.enable_binary_authorization
│ 
│ Deprecated in favor of binary_authorization.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-vns3s2yxpa-uc.a.run.app/lock?id=mcdermg%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
